[
    {
        "name": "This Tomato Tart Looks Fancy but Couldn't Be Easier",
        "ingredients": [
            "1/2 recipe old-fashioned flaky pie dough prepared through step 2 or 1 sheet frozen puff pastry (397 g; 14 ounces), thawed",
            "4 tablespoons (2 ounces; 57 g) unsalted butter, softened, divided",
            "1 small yellow onion (4 ounces; 113 g), thinly sliced (about 3/4 cup)",
            "2 tablespoons (30 ml) dry sherry (such as fino or manzanilla)",
            "3/4 cup (180 ml) homemade chicken stock or store-bought low-sodium chicken or vegetable broth",
            "1 teaspoon chopped fresh thyme leaves",
            "1/2 teaspoon Diamond Crystal kosher salt, divided; for table salt, use half as much by volume",
            "1 tablespoon granulated sugar (1/2 ounce; 15 g)",
            "1/4 teaspoon freshly ground black pepper, plus more for serving",
            "1 pound (455 g) cherry or grape tomatoes (see notes)",
            "2 ounces (57 g) Gruyère cheese, grated (about 1/2 cup)",
            "2 tablespoons (30 ml) Dijon mustard",
            "Fresh thyme leaves, for serving",
            "Flaky sea salt, for serving"
        ],
        "steps": [
            "If using homemade pie dough: Line a large plate with parchment. Roll one portion of dough into a 10-inch round and transfer to prepared plate. Working around circumference, fold 1/2-inch of dough over itself and pinch to create a 9-inch round with a raised rim. Cut three 2-inch shallow slits in center of dough, and refrigerate for at least 2 hours and up to 24 hours. (If refrigerating overnight, cover dough with plastic wrap.) If using store-bought puff pastry: On a lightly floured surface, roll puff pastry large enough to cut out a 10-inch round. Place an inverted 10-inch skillet, bowl, or cake pan on the dough, then cut around it to form a circle. Transfer dough to a large parchment-lined plate. Working around circumference, fold 1/2-inch of dough over itself and pinch to create a 9-inch round with a raised rim. Using a fork, prick bottom of dough all over, and refrigerate for at least 2 hours and up to 24 hours. (If refrigerating overnight, cover dough with plastic wrap.)",
            "Adjust oven rack to middle position. Preheat oven to 400°F (200°C). In a medium stainless steel skillet, melt 1 tablespoon (1/2 ounce; 14 g) butter over medium-high heat. Add onion and cook, stirring occasionally, adding 1 tablespoon of water at a time as needed to prevent scorching, until caramelized and deep golden brown, about 15 minutes. Stir in sherry, using a wooden spoon to scrape any browned bits from bottom of skillet. Add stock, bring to a simmer over medium-high heat and cook, stirring occasionally, until mixture is jammy and liquid has thickened, 6 to 10 minutes. Stir in thyme and 1/4 teaspoon kosher salt. Remove from heat; set aside.",
            "In a 10-inch oven-safe skillet, spread remaining 3 tablespoons (1 1/2 ounces; 43 g) butter evenly over bottom. Sprinkle sugar, pepper, and remaining 1/4 teaspoon kosher salt evenly over butter. Arrange tomatoes in an even layer over butter.",
            "Transfer skillet to stove. Cook over high heat without stirring until tomatoes have slightly softened and butter-sugar mixture is amber, about 6 to 8 minutes, rotating skillet occasionally to maintain even browning. Remove from heat.",
            "Spoon caramelized onions into empty spaces among tomatoes. Evenly top tomatoes with Gruyère.",
            "Spread mustard evenly over prepared dough or pastry within rim, and carefully invert the dough over tomatoes, mustard-side down, making sure dough or pastry is centered.",
            "Bake until crust is deep golden brown, 30 to 35 minutes. Transfer skillet to wire rack and let cool for 5 minutes.",
            "Place a large plate over skillet, then carefully invert tart onto plate. Rearrange any tomatoes that have shifted during unmolding. Allow to cool slightly, about 20 minutes. Top with thyme, flaky sea salt, and additional pepper. Serve."
        ],
        "prep_time": 20,
        "cook_time": 70,
        "total_time": 235,
        "step_times": []
    },
    {
        "name": "Vodka Pizza",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, plus more for drizzling",
            "4 medium cloves garlic, minced (about 4 teaspoons)",
            "1 teaspoon dried oregano",
            "1/2 teaspoon red pepper flakes",
            "1 (28-ounce) can whole peeled tomatoes, roughly broken up by hand",
            "1 cup heavy cream",
            "1/3 cup vodka",
            "Kosher salt and freshly ground black pepper",
            "1 recipe Basic New York Pizza Dough, divided and risen at least 2 hours",
            "1 pound fresh mozzarella (preferably buffalo milk), torn into rough 3/4- to 1-inch chunks and drained in a fine mesh strainer set over a bowl",
            "12 to 16 basil leaves"
        ],
        "steps": [
            "Heat olive oil in a medium saucepan over medium heat until shimmering. Add garlic, oregano, and pepper flakes and cook, stirring constantly, until fragrant, about 1 minute. Add tomatoes. Increase heat to high, bring to a boil, then reduce to a bare simmer. Cook, stirring occasionally, until reduced by 1/4, about 20 minutes. Add heavy cream, increase heat to bring to a boil, reduce to a simmer, and continue to cook until reduced again by 1/4, about 20 minutes longer. Add vodka and cook for 7 minutes. Remove from heat and season to taste with salt and pepper.",
            "Let sauce cool slightly, then transfer half of sauce to the jar of a blender. Blend, starting on lowest speed and gradually increasing to high until completely smooth, about 2 minutes total. Strain through a fine-mesh strainer into a medium bowl. Repeat with remaining half of sauce. (For storing extra sauce, see Make-Ahead and Storage below).",
            "At least 45 minutes before baking, place a baking stone or steel on an oven rack set to the top position and preheat oven to 550°F (290°C).",
            "Turn single dough ball out onto lightly flour surface. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough by draping over knuckles into a 12 to 14-inch circle about 1/4-inch thick. Transfer to pizza peel.",
            "Spread approximately 3/4 cup of sauce evenly over surface of crust, leaving 1/2 to 1-inch border along edge. Place 8 to 10 chunks of mozzarella evenly over surface of pizza and scatter with 4 to 5 basil leaves. Drizzle with about 1 tablespoon extra-virgin olive oil and sprinkle with salt. Slide pizza onto stone or steel and bake until cheese is melted and crust underbelly is spotty brown, 6 to 12 minutes total. Remove from oven with metal pizza peel, transfer to cutting board, slice, and serve. Repeat steps 3 and 4 with remaining ingredients to make 2 additional pizzas."
        ],
        "prep_time": 15,
        "cook_time": 90,
        "total_time": 110,
        "step_times": [
            50,
            5,
            45,
            10,
            10
        ]
    }
]