[
    {
        "name": "Tomato Tart",
        "ingredients": [
            "1/2 recipe old-fashioned flaky pie dough prepared through step 2 or 1 sheet frozen puff pastry (397 g; 14 ounces), thawed",
            "4 tablespoons (2 ounces; 57 g) unsalted butter, softened, divided",
            "1 small yellow onion (4 ounces; 113 g), thinly sliced (about 3/4 cup)",
            "2 tablespoons (30 ml) dry sherry (such as fino or manzanilla)",
            "3/4 cup (180 ml) homemade chicken stock or store-bought low-sodium chicken or vegetable broth",
            "1 teaspoon chopped fresh thyme leaves",
            "1/2 teaspoon Diamond Crystal kosher salt, divided; for table salt, use half as much by volume",
            "1 tablespoon granulated sugar (1/2 ounce; 15 g)",
            "1/4 teaspoon freshly ground black pepper, plus more for serving",
            "1 pound (455 g) cherry or grape tomatoes (see notes)",
            "2 ounces (57 g) Gruyère cheese, grated (about 1/2 cup)",
            "2 tablespoons (30 ml) Dijon mustard",
            "Fresh thyme leaves, for serving",
            "Flaky sea salt, for serving"
        ],
        "steps": [
            "If using homemade pie dough: Line a large plate with parchment. Roll one portion of dough into a 10-inch round and transfer to prepared plate. Working around circumference, fold 1/2-inch of dough over itself and pinch to create a 9-inch round with a raised rim. Cut three 2-inch shallow slits in center of dough, and refrigerate for at least 2 hours and up to 24 hours. (If refrigerating overnight, cover dough with plastic wrap.) If using store-bought puff pastry: On a lightly floured surface, roll puff pastry large enough to cut out a 10-inch round. Place an inverted 10-inch skillet, bowl, or cake pan on the dough, then cut around it to form a circle. Transfer dough to a large parchment-lined plate. Working around circumference, fold 1/2-inch of dough over itself and pinch to create a 9-inch round with a raised rim. Using a fork, prick bottom of dough all over, and refrigerate for at least 2 hours and up to 24 hours. (If refrigerating overnight, cover dough with plastic wrap.)",
            "Adjust oven rack to middle position. Preheat oven to 400°F (200°C). In a medium stainless steel skillet, melt 1 tablespoon (1/2 ounce; 14 g) butter over medium-high heat. Add onion and cook, stirring occasionally, adding 1 tablespoon of water at a time as needed to prevent scorching, until caramelized and deep golden brown, about 15 minutes. Stir in sherry, using a wooden spoon to scrape any browned bits from bottom of skillet. Add stock, bring to a simmer over medium-high heat and cook, stirring occasionally, until mixture is jammy and liquid has thickened, 6 to 10 minutes. Stir in thyme and 1/4 teaspoon kosher salt. Remove from heat; set aside.",
            "In a 10-inch oven-safe skillet, spread remaining 3 tablespoons (1 1/2 ounces; 43 g) butter evenly over bottom. Sprinkle sugar, pepper, and remaining 1/4 teaspoon kosher salt evenly over butter. Arrange tomatoes in an even layer over butter.",
            "Transfer skillet to stove. Cook over high heat without stirring until tomatoes have slightly softened and butter-sugar mixture is amber, about 6 to 8 minutes, rotating skillet occasionally to maintain even browning. Remove from heat.",
            "Spoon caramelized onions into empty spaces among tomatoes. Evenly top tomatoes with Gruyère.",
            "Spread mustard evenly over prepared dough or pastry within rim, and carefully invert the dough over tomatoes, mustard-side down, making sure dough or pastry is centered.",
            "Bake until crust is deep golden brown, 30 to 35 minutes. Transfer skillet to wire rack and let cool for 5 minutes.",
            "Place a large plate over skillet, then carefully invert tart onto plate. Rearrange any tomatoes that have shifted during unmolding. Allow to cool slightly, about 20 minutes. Top with thyme, flaky sea salt, and additional pepper. Serve."
        ],
        "prep_time": 20,
        "cook_time": 70,
        "total_time": 235,
        "step_times": [
            5,
            5,
            5,
            5,
            5,
            5,
            5,
            5
        ]
    },
    {
        "name": "Vodka Pizza",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, plus more for drizzling",
            "4 medium cloves garlic, minced (about 4 teaspoons)",
            "1 teaspoon dried oregano",
            "1/2 teaspoon red pepper flakes",
            "1 (28-ounce) can whole peeled tomatoes, roughly broken up by hand",
            "1 cup heavy cream",
            "1/3 cup vodka",
            "Kosher salt and freshly ground black pepper",
            "1 recipe Basic New York Pizza Dough, divided and risen at least 2 hours",
            "1 pound fresh mozzarella (preferably buffalo milk), torn into rough 3/4- to 1-inch chunks and drained in a fine mesh strainer set over a bowl",
            "12 to 16 basil leaves"
        ],
        "steps": [
            "Heat olive oil in a medium saucepan over medium heat until shimmering. Add garlic, oregano, and pepper flakes and cook, stirring constantly, until fragrant, about 1 minute. Add tomatoes. Increase heat to high, bring to a boil, then reduce to a bare simmer. Cook, stirring occasionally, until reduced by 1/4, about 20 minutes. Add heavy cream, increase heat to bring to a boil, reduce to a simmer, and continue to cook until reduced again by 1/4, about 20 minutes longer. Add vodka and cook for 7 minutes. Remove from heat and season to taste with salt and pepper.",
            "Let sauce cool slightly, then transfer half of sauce to the jar of a blender. Blend, starting on lowest speed and gradually increasing to high until completely smooth, about 2 minutes total. Strain through a fine-mesh strainer into a medium bowl. Repeat with remaining half of sauce. (For storing extra sauce, see Make-Ahead and Storage below).",
            "At least 45 minutes before baking, place a baking stone or steel on an oven rack set to the top position and preheat oven to 550°F (290°C).",
            "Turn single dough ball out onto lightly flour surface. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough by draping over knuckles into a 12 to 14-inch circle about 1/4-inch thick. Transfer to pizza peel.",
            "Spread approximately 3/4 cup of sauce evenly over surface of crust, leaving 1/2 to 1-inch border along edge. Place 8 to 10 chunks of mozzarella evenly over surface of pizza and scatter with 4 to 5 basil leaves. Drizzle with about 1 tablespoon extra-virgin olive oil and sprinkle with salt. Slide pizza onto stone or steel and bake until cheese is melted and crust underbelly is spotty brown, 6 to 12 minutes total. Remove from oven with metal pizza peel, transfer to cutting board, slice, and serve. Repeat steps 3 and 4 with remaining ingredients to make 2 additional pizzas."
        ],
        "prep_time": 15,
        "cook_time": 90,
        "total_time": 110,
        "step_times": [
            50,
            5,
            45,
            10,
            10
        ]
    },
    {
        "name": "Rib Lovers, Meet the Pork Steak: A St. Louis Barbecue Legend",
        "ingredients": [
            "2 tablespoons (18 g) Diamond Crystal kosher salt; for table salt, use half as much by volume",
            "2 tablespoons (24 g) light brown sugar",
            "1 tablespoon (7 g) fresh ground pepper",
            "2 teaspoons (4 g) dry mustard powder",
            "2 teaspoons (4 g) MSG (optional but recommended)",
            "2 cups (480 ml) ketchup, (see notes)",
            "1/2 cup (120 ml) apple cider vinegar",
            "1/2 cup (120 ml) Worcestershire sauce",
            "2 tablespoons Louisiana-style cayenne hot sauce, such as Crystal",
            "2 teaspoons Diamond Crystal kosher salt; for table salt, use half as much by volume",
            "1/2 cup (110 g) light brown sugar",
            "3/4 teaspoon ground cloves",
            "4 bone-in pork blade steaks (1 to 1 1/2 pounds each; 5-6 pounds total), about 1-inch thick",
            "Simple Pork Steak Rub recipe from above",
            "St. Louis Barbecue Sauce recipe from above",
            "1 (12-ounce) can American lager, such as Budweiser"
        ],
        "steps": [
            "For the Simple Pork Steak Rub: In a small bowl, add all ingredients and whisk to combine. Store in an airtight container until ready to use or up to 3 months.",
            "For Preparing the Steaks: Pat pork steaks dry with paper towels. Season generously on both sides with prepared pork steak rub and gently pat rub into steaks to help adhere. Transfer to a wire rack set over a rimmed baking sheet and refrigerate uncovered for at least 4 hours and up to 12 hours.",
            "For the St. Louis Barbecue Sauce: In a medium saucepan, combine all ingredients. Bring to a simmer over medium-high heat, then reduce heat to medium-low and continue simmering, stirring occasionally, until slightly thickened, 10 to 12 minutes. Lower heat if necessary to maintain a gentle simmer. Let cool, then refrigerate until ready to use or up to 1 month.",
            "If Using a Charcoal Grill: Prepare a charcoal grill for two-zone cooking at 250 to 275°F: Spread 3 quarts of unlit charcoal briquettes (about 1/2 chimney's worth of coals) evenly over half of the grill grate. Light a 1/4 chimney (about 1 1/2 quarts) of charcoal. When top coals are partially covered with ash, pour evenly over unlit coals. Set cooking grate in place and cover, positioning the top vent over the empty side of the grill, not the coals. Adjust bottom vent of grill to half open and adjust top vent of lid to 3/4 open. Attach a probe thermometer to the grill grate, if using, away from the direct heat (if not using, monitor heat with thermometer on grill lid). When grill reaches about 200°F, adjust both vents as needed to maintain a final cooking temperature between 250-275°F. If grill runs hot, narrow the vents slightly. If temperature drops too low, open vents a little bit. In case of dramatic temperature fluctuations that you can’t fix by adjusting the vents, add or remove coals using tongs. That should be a last resort. If Using a Gas Grill: Preheat gas grill with all burners on high until hot, about 10 minutes. Leave on primary burner (the one closest to the gas tank), and turn off remaining burners to create an indirect heat zone around 250 to 275°F.",
            "Set a 9x13-inch disposable aluminum foil pan on the cool side of the grill. Add barbecue sauce and beer to pan and stir to combine and hold warm.",
            "Transfer steaks into the sauce one at a time, flip to coat. Then, stack steaks in sauce in pan in two layers.",
            "If you have a leave-in thermometer, insert it into the thickest part of one steak. Cover pan tightly with 2 layers of foil, crimping the edges to seal. Close grill and braise steaks until their internal temperature registers 195-200°F with a leave-in or instant-read thermometer, about 2 to 3 hours. Halfway through cooking, rotate the pan and quickly (so you lose as little heat as possible) and carefully remove foil from pan using grilling gloves or pot holders, and flip steak stacks so that the steaks braising on the bottom are on top, and vice-versa. Re-seal pan with your 2 layers of foil, and continue cooking.",
            "If using a charcoal grill, light another half chimney of coals during the final 15 minutes of cooking.",
            "To Finish the Steaks: Remove pan from grill. Carefully remove the steaks from the pan to a cutting board or plate using a spatula and tongs (they will be tender!) and set aside while reheating the grill. If using a charcoal grill , scatter a 1/2 chimney (about 3 quarts) of lit coals evenly across bottom of grill grate. If using a gas grill, raise temperature to medium-high. Close lid and let heat for 5 to 10 minutes. While the grill preheats, using a ladle or large spoon, skim as much fat as possible off the surface of the braising liquid.",
            "Once grill is hot, use a spatula to carefully transfer steaks to the hot grill and cook, flipping carefully once every 2 minutes and basting with the skimmed braising liquid, until steaks develop a reddish-brown lacquered finish and some char along the edges, 8 to 10 minutes. If using a gas grill, lower temperature as needed to prevent burning. If using a charcoal grill, be prepared to flip more often for even charring. Stop basting before the final flip to allow the glaze to set.",
            "Alternative Oven Method: In a 9x13 pan, add beer and barbecue sauce and stir to combine. Transfer seasoned steaks to a wire rake set in a rimmed baking sheet. Adjust oven rack to 6 inches from top broiler unit. Preheat broiler on high and broil steaks until lightly charred, about 5 minutes per side. Transfer steaks to sauce in pan and cover tightly with 2 layers of foil. Adjust oven temperature to 250°F (120°C). Braise steaks in a tightly covered pan until their internal temperature registers 195-200°F with an instant-read thermometer, 2 1/2 to 3 hours, flipping and checking for tenderness as described in step 7 above. Carefully remove steaks from braising liquid and transfer to a wire rack set in a rimmed baking sheet. Broil, using a basting or pastry brush to brush each side with sauce twice, until red and lightly charred, 3 to 5 minutes per side. Watch closely to avoid burning.",
            "To Finish: Transfer steaks to a cutting board and let steaks rest for 5 to 10 minutes. Slice and serve hot. Serve remaining braising liquid on the side, if desired."
        ],
        "prep_time": 15,
        "cook_time": 150,
        "total_time": 405,
        "step_times": [
            5,
            5,
            5,
            5,
            5,
            5,
            5,
            5,
            5,
            5,
            5,
            5
        ]
    }
]